##### We  would be performing a set of task on the test data to bring it to the same dimensions as our modified train set

In [1]:
import pandas as panda
import numpy as np

In [2]:
train_data = panda.read_csv('data/train_2.csv')
test_data = panda.read_csv('data/test.csv')

train_data.shape, test_data.shape

((2973, 177), (23856, 142))

In [5]:
train_household_ids = train_data.idhogar.values.tolist()
test_household_ids = test_data.idhogar.values.tolist()

len(set(train_household_ids)),len(test_household_ids), len(set(test_household_ids))

(2973, 23856, 7352)

In [11]:
columns_name_dict = {
                    'edjefe':'male_education_years',
                    'edjefa':'female_education_years',
                    'v18q1':'num_of_tablets',
                    'v18q':'tablet_owner',
                    'v2a1':'monthly_rent_paid',
                    'r4h1':'males_below_12',
                    'r4h2':'males_above_12',
                    'r4h3':'total_males',
                    'r4m1':'females_below_12',
                    'r4m2':'females_above_12',
                    'r4m3':'total_females',
                    'r4t1':'person_below_12',
                    'r4t2':'person_above_12',
                    'r4t3':'total_num_person',
                    'tamviv' : 'total_living',
                    'escolari' : 'yrs_of_schooling',
                    'rez_esc' : 'yrs_behind_in_school',
                    'meaneduc' : 'average_education',
                    'hogar_nin': 'num_children', #Number of children 0 to 19 in household
                    'hogar_adul': 'num_adults',
                    'hogar_mayor': 'num_senior',
                    'hogar_total' : 'total_individuals',
                    
                    }
test_data.rename(columns = columns_name_dict, inplace = True)

In [26]:
test_data.columns = [str(i).lower() for i in test_data.columns.tolist() ]

In [27]:
columns_name_dict = {
                    'edjefe':'male_education_years',
                    'edjefa':'female_education_years',
                    'v18q1':'num_of_tablets',
                    'v18q':'tablet_owner',
                    'v2a1':'monthly_rent_paid',
                    'r4h1':'males_below_12',
                    'r4h2':'males_above_12',
                    'r4h3':'total_males',
                    'r4m1':'females_below_12',
                    'r4m2':'females_above_12',
                    'r4m3':'total_females',
                    'r4t1':'person_below_12',
                    'r4t2':'person_above_12',
                    'r4t3':'total_num_person',
                    'tamviv' : 'total_living',
                    'escolari' : 'yrs_of_schooling',
                    'rez_esc' : 'yrs_behind_in_school',
                    'meaneduc' : 'average_education',
                    'hogar_nin': 'num_children', #Number of children 0 to 19 in household
                    'hogar_adul': 'num_adults',
                    'hogar_mayor': 'num_senior',
                    'hogar_total' : 'total_individuals',
                    
                    }
test_data.rename(columns = columns_name_dict, inplace = True)

In [13]:

test_data_dtypes = panda.DataFrame(test_data.dtypes).reset_index()
test_data_dtypes.columns = ['col_name', 'col_type']
test_data_dtypes[test_data_dtypes['col_type']==np.object]

                   col_name col_type
0                        Id   object
95                  idhogar   object
100              dependency   object
101    male_education_years   object
102  female_education_years   object

In [15]:

##there are no empty objects in any of the object types columns
test_data[test_data_dtypes[test_data_dtypes['col_type']==np.object].col_name.tolist()].isnull().sum()

Id                        0
idhogar                   0
dependency                0
male_education_years      0
female_education_years    0
dtype: int64

In [17]:
test_data.male_education_years.value_counts()

no     9056
6      5113
11     1756
9      1078
8       763
3       739
15      625
14      596
7       563
17      500
16      475
5       463
2       423
12      381
4       368
yes     293
10      284
13      238
21       68
19       30
20       24
18       20
Name: male_education_years, dtype: int64

In [18]:
test_data.female_education_years.value_counts()

no     15845
6       2454
11       951
9        498
15       468
5        447
8        410
7        382
3        381
16       280
14       264
4        263
2        263
17       235
10       228
12       155
yes      145
13       142
21        24
19        10
18         6
20         5
Name: female_education_years, dtype: int64

In [21]:
## we can see existence of yes/no values in both data series. we are going to be replacing it with 1/0 as
## directed in the data dictionary

test_data['male_education_years'] = test_data.male_education_years.apply(lambda x : 1 if  x =='yes' else (0 if x=='no' else x))
test_data['female_education_years'] = test_data.female_education_years.apply(lambda x : 1 if  x =='yes' else (0 if x=='no' else x))
test_data['male_education_years'] = test_data.male_education_years.astype(np.int64)
test_data['female_education_years'] = test_data.female_education_years.astype(np.int64)

In [24]:
test_data.male_education_years.value_counts().head(),test_data.female_education_years.value_counts().head()

(0     9056
 6     5113
 11    1756
 9     1078
 8      763
 Name: male_education_years, dtype: int64, 0     15845
 6      2454
 11      951
 9       498
 15      468
 Name: female_education_years, dtype: int64)

In [30]:
test_data.dependency.value_counts()

yes          5388
no           4289
.5           3678
2            1769
1.5          1758
.33333334    1533
.66666669    1130
8            1037
.25           684
3             596
1.3333334     278
2.5           224
.2            216
.75           203
4             195
.40000001     175
.60000002     128
1.6666666     120
5              96
.16666667      56
1.25           54
.80000001      45
.14285715      32
2.3333333      30
.83333331      22
3.5            18
7              16
2.25           13
3.3333333      13
.85714287      13
1.2            11
.375           11
.125            9
.2857143        9
6               7
Name: dependency, dtype: int64

In [36]:
## replace yes/no value with square root of sqbdependency according to data dictionary

test_data[['dependency','sqbdependency']].loc[test_data['dependency'].isin(['yes','no']) & ~test_data['sqbdependency'].isna()].head()

  dependency  sqbdependency
3         no            0.0
5         no            0.0
6         no            0.0
7         no            0.0
8         no            0.0

In [40]:
# to recheekc the hypothesis that yes = 1 and no = 0 for dependency, lets run a value check
test_data[['dependency','sqbdependency']].loc[(test_data['sqbdependency']!=0) & (test_data['dependency']=='no' )]

Empty DataFrame
Columns: [dependency, sqbdependency]
Index: []

In [41]:
test_data[['dependency','sqbdependency']].loc[(test_data['sqbdependency']!=1) & (test_data['dependency']=='yes' )]

Empty DataFrame
Columns: [dependency, sqbdependency]
Index: []

In [42]:
test_data['dependency'] =  test_data.dependency.apply(lambda x: 1 if x=='yes' else (0 if x=='no' else x)).astype(np.float64)
test_data['dependency'].value_counts()

1.000000    5388
0.000000    4289
0.500000    3678
2.000000    1769
1.500000    1758
0.333333    1533
0.666667    1130
8.000000    1037
0.250000     684
3.000000     596
1.333333     278
2.500000     224
0.200000     216
0.750000     203
4.000000     195
0.400000     175
0.600000     128
1.666667     120
5.000000      96
0.166667      56
1.250000      54
0.800000      45
0.142857      32
2.333333      30
0.833333      22
3.500000      18
7.000000      16
0.857143      13
3.333333      13
2.250000      13
1.200000      11
0.375000      11
0.125000       9
0.285714       9
6.000000       7
Name: dependency, dtype: int64

In [79]:
test_data_dtypes = panda.DataFrame(test_data.dtypes).reset_index()
test_data_dtypes.columns = ['col_name', 'col_type']
test_data_dtypes.col_type.value_counts()

int64      131
float64      9
object       2
Name: col_type, dtype: int64

In [80]:
test_data_dtypes[test_data_dtypes['col_type']==np.float64]

                                        col_name col_type
1                              monthly_rent_paid  float64
8                                 num_of_tablets  float64
99                                    dependency  float64
112                                 overcrowding  float64
136                              sqbovercrowding  float64
137                                sqbdependency  float64
139           yrs_behind_in_school_nan_with_mean  float64
140  yrs_behind_in_school_nan_with_max_appearing  float64
141                            average_education  float64

In [81]:
test_data[test_data_dtypes[test_data_dtypes['col_type']==np.float64].col_name.values.tolist()].isnull().sum()

monthly_rent_paid                              0
num_of_tablets                                 0
dependency                                     0
overcrowding                                   0
sqbovercrowding                                0
sqbdependency                                  0
yrs_behind_in_school_nan_with_mean             0
yrs_behind_in_school_nan_with_max_appearing    0
average_education                              0
dtype: int64

In [51]:
##we will replace average_education with mean and max appearing in separate columns and we willl drop the columns
## average education and sqbmeaned

most_appearing = test_data.average_education.value_counts().idxmax()
mean = np.mean(test_data[~test_data.average_education.isna()]['average_education'].values)
most_appearing, mean

test_data['yrs_behind_in_school_nan_with_mean'] = test_data['average_education']
test_data['yrs_behind_in_school_nan_with_max_appearing'] = test_data['average_education']
test_data['yrs_behind_in_school_nan_with_max_appearing'].fillna(value = most_appearing, inplace=True)
test_data['yrs_behind_in_school_nan_with_mean'].fillna(value = mean, inplace=True)

In [52]:
test_data[['yrs_behind_in_school_nan_with_mean','yrs_behind_in_school_nan_with_max_appearing']].isnull().any()

yrs_behind_in_school_nan_with_mean             False
yrs_behind_in_school_nan_with_max_appearing    False
dtype: bool

In [57]:
# tipovivi3
## are there any households which are rented however are marked as nan in rent paid
## if not we will simply replace the monthly rent paid as 0
test_data[['tipovivi3','monthly_rent_paid']].loc[(test_data.monthly_rent_paid.isna()) & (test_data.tipovivi3==1)]

Empty DataFrame
Columns: [tipovivi3, monthly_rent_paid]
Index: []

In [59]:
test_data['monthly_rent_paid'].fillna(value = 0, inplace=True)

In [62]:
## lets chek if there are any tablet owbners who have been marked as having nan no of tables

test_data[['tablet_owner','num_of_tablets']].loc[ (test_data['tablet_owner']==1) & (test_data['num_of_tablets'].isna())]

Empty DataFrame
Columns: [tablet_owner, num_of_tablets]
Index: []

In [63]:
test_data['num_of_tablets'].fillna(value = 0, inplace = True)

In [70]:
mean_educ= np.mean(test_data[~test_data.average_education.isna()].average_education.values)
test_data['average_education'].fillna(value= mean_educ, inplace = True)
test_data.drop(columns=['sqbmeaned'], inplace= True)

In [78]:
test_data.drop(columns = ['yrs_behind_in_school'], inplace = True)

In [85]:

##none of the integer columns are nan, hence we can simply ignore them
test_data[test_data_dtypes[test_data_dtypes['col_type']==np.int64].col_name.values.tolist()].isnull().any().sum()

0

In [86]:
agg_columns = [
    'idhogar',
    'yrs_behind_in_school_nan_with_max_appearing',
    'yrs_behind_in_school_nan_with_mean',
    'yrs_of_schooling',
    'average_education',
    'male_education_years',
    'female_education_years',
    
]

In [87]:
groupby_idhogar = test_data.groupby(['idhogar'])

In [88]:
##perform some aggregation
t = groupby_idhogar.agg(

{
    'male_education_years':['sum','mean','max','min','std'],
    'female_education_years':['sum','mean','max','min','std'],
    'average_education' : ['nunique','sum','mean','max','min','std'],
    'yrs_of_schooling' : ['nunique','sum','mean','max','min','std'],
    'yrs_behind_in_school_nan_with_mean' : ['nunique','sum','mean','max','min','std'],
    'yrs_behind_in_school_nan_with_max_appearing' : ['nunique','sum','mean','max','min','std'],
    
}

)

In [89]:
t.reset_index(inplace=True)
# t.columns = new_cols
t.head()

     idhogar male_education_years                   female_education_years  \
                              sum mean max min  std                    sum
0  000a08204                   36   12  12  12  0.0                      0
1  000bce7c4                    0    0   0   0  0.0                      0
2  001845fb0                   24    6   6   6  0.0                      0
3  003514e22                   56   14  14  14  0.0                      0
4  003b51a87                    0    0   0   0  0.0                      8

               ...  yrs_behind_in_school_nan_with_mean                        \
  mean max min ...                                mean        max        min
0    0   0   0 ...                           13.000000  13.000000  13.000000
1    0   0   0 ...                            2.500000   2.500000   2.500000
2    0   0   0 ...                           13.666667  13.666667  13.666667
3    0   0   0 ...                           10.000000  10.000000  10.000000
4    2   2   2 ...                            4.000000   4.000000   4.000000

       yrs_behind_in_school_nan_with_max_appearing                        \
   std                                     nunique        sum       mean
0  0.0                                           1  39.000000  13.000000
1  0.0                                           1   5.000000   2.500000
2  0.0                                           1  54.666668  13.666667
3  0.0                                           1  40.000000  10.000000
4  0.0                                           1  16.000000   4.000000


         max        min  std
0  13.000000  13.000000  0.0
1   2.500000   2.500000  0.0
2  13.666667  13.666667  0.0
3  10.000000  10.000000  0.0
4   4.000000   4.000000  0.0

[5 rows x 35 columns]

In [90]:
new_cols=[('occupants_'+i+'_'+j) for (i,j) in t.columns.tolist()]

t.columns = new_cols

In [91]:
t.rename(columns={'occupants_idhogar_':'idhogar'}, inplace=True)
t.fillna(value=0, inplace=True) ## why would be get nan,, coz some households have single entry and are 
t.head()

,idhogar,occupants_male_education_years_sum,occupants_male_education_years_mean,occupants_male_education_years_max,occupants_male_education_years_min,occupants_male_education_years_std,occupants_female_education_years_sum,occupants_female_education_years_mean,occupants_female_education_years_max,occupants_female_education_years_min,...,occupants_yrs_behind_in_school_nan_with_mean_mean,occupants_yrs_behind_in_school_nan_with_mean_max,occupants_yrs_behind_in_school_nan_with_mean_min,occupants_yrs_behind_in_school_nan_with_mean_std,occupants_yrs_behind_in_school_nan_with_max_appearing_nunique,occupants_yrs_behind_in_school_nan_with_max_appearing_sum,occupants_yrs_behind_in_school_nan_with_max_appearing_mean,occupants_yrs_behind_in_school_nan_with_max_appearing_max,occupants_yrs_behind_in_school_nan_with_max_appearing_min,occupants_yrs_behind_in_school_nan_with_max_appearing_std
0,000a08204,36,12,12,12,0.0,0,0,0,0,...,13.000000,13.000000,13.000000,0.0,1,39.000000,13.000000,13.000000,13.000000,0.0
1,000bce7c4,0,0,0,0,0.0,0,0,0,0,...,2.500000,2.500000,2.500000,0.0,1,5.000000,2.500000,2.500000,2.500000,0.0
2,001845fb0,24,6,6,6,0.0,0,0,0,0,...,13.666667,13.666667,13.666667,0.0,1,54.666668,13.666667,13.666667,13.666667,0.0
3,003514e22,56,14,14,14,0.0,0,0,0,0,...,10.000000,10.000000,10.000000,0.0,1,40.000000,10.000000,10.000000,10.000000,0.0
4,003b51a87,0,0,0,0,0.0,8,2,2,2,...,4.000000,4.000000,4.000000,0.0,1,16.000000,4.000000,4.000000,4.000000,0.0

In [92]:
test_data.shape, t.shape

((23856, 142), (7352, 35))

In [93]:
tt = panda.merge(test_data,t, how = 'inner' , on='idhogar')

In [94]:
tt.shape

(23856, 176)

In [95]:
aa = tt[tt.parentesco1==1]
aa.shape

(7334, 176)

In [96]:
aa.isnull().any().sum()

0

In [97]:
aa.to_csv('data/test_2.csv', index= False)